//1.Вивести на сторінку в один рядок через кому числа від 10 до 20
document.write(`<h3>1.Вивести на сторінку в один рядок через кому числа від 10 до 20:</h3>`);
for (let i = 10; i <= 20; i++) {
    document.write(`${i}, `);
}

//2.Вивести квадрати чисел від 10 до 20

document.write(`<h3>2.Вивести квадрати чисел від 10 до 20:</h3>`);
for (let i = 10; i <= 20; i++) {
    document.write(`${i**2}, `);
}

//3.Вивести таблицю множення на 7

document.write(`<h3>3.Вивести таблицю множення на 7:</h3>`);
for (let i = 1; i <= 10; i++) {
    document.write(`7 x ${i} = ${i*7}<br>`);
}

//4.Знайти суму всіх цілих чисел від 1 до 15

document.write(`<h3>4.Знайти суму всіх цілих чисел від 1 до 15:</h3>`);
let summ = 0;
for (let i = 1; i <= 15; i++) {
    summ += i;
}
document.write(summ);

//5.Знайти добуток усіх цілих чисел від 15 до 35

document.write(`<h3>5.Знайти добуток усіх цілих чисел від 15 до 35:</h3>`);
let integers = 1;
for (let i = 15; i <= 35; i++) {
    integers *= i;
}
document.write(integers);

//6.Знайти середнє арифметичне всіх цілих чисел від 1 до 500

document.write(`<h3>6.Знайти середнє арифметичне всіх цілих чисел від 1 до 500:</h3>`);
summ = 0;
for (let i = 1; i <= 500; i++) {
    summ += i;
}
document.write(summ / 500);

//7.Вивести суму лише парних чисел в діапазоні від 30 до 80

document.write(`<h3>7.Вивести суму лише парних чисел в діапазоні від 30 до 80:</h3>`);
summ = 0;
for (let i = 30; i <= 80; i += 2) {
    if (i % 2 == 0) {
        summ += i;
    }
}
document.write(summ);

//8.Вивести всі числа в діапазоні від 100 до 200 кратні 3

document.write(`<h3>8.Вивести всі числа в діапазоні від 100 до 200 кратні 3:</h3>`);
for (let i = 100; i <= 200; i++) {
    if (i % 3 == 0) {
        document.write(`${i}, `);
    }
}

//9.Дано натуральне число. Знайти та вивести на сторінку всі його дільники

document.write(`<h3>9.Дано натуральне число. Знайти та вивести на сторінку всі його дільники:</h3>`);
let naturalNumber = prompt(`Введіть будь-яке натуральне число`, 'Число')
for (let i = 1; i <= naturalNumber; i++) {
    if (naturalNumber % i == 0) {
        document.write(`${i}, `);
    }
}

//10.Визначити кількість його парних дільників

document.write(`<h3>10.Визначити кількість його парних дільників:</h3>`);
let number = 0;
for (let i = 1; i <= naturalNumber; i++) {
    if (naturalNumber % i == 0 && i % 2 == 0) {
        number += 1;
    }
}
document.write(number);

//11.Знайти суму його парних дільників
document.write(`<h3>11.Знайти суму його парних дільників:</h3>`);
summ = 0;
for (let i = 1; i <= naturalNumber; i++) {
    if (naturalNumber % i == 0 && i % 2 == 0) {
        summ += i;
    }
}
document.write(summ);

//12.Надрукувати повну таблицю множення від 1 до 10

document.write(`<h3>12.Надрукувати повну таблицю множення від 1 до 10:</h3>`);
for (let a = 1; a <= 10; a++) {
    for (let i = 1; i <= 10; i++) {
        document.write(`${a} x ${i} = ${i * a}<br>`);
    }
}